In [1]:
### Data manipulation with pandas
import pandas as pd
df = pd.read_csv('data.csv')

In [2]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [3]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [4]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [5]:
df.isnull()

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [7]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [8]:
df_filled = df.fillna(0)
df_filled.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [9]:
## filling missing values with the mean of the column
df['filled_val'] = df['Value'].fillna(df['Value'].mean())
df

          Date Category  Value   Product  Sales Region  filled_val
0   2023-01-01        A   28.0  Product1  754.0   East   28.000000
1   2023-01-02        B   39.0  Product3  110.0  North   39.000000
2   2023-01-03        C   32.0  Product2  398.0   East   32.000000
3   2023-01-04        B    8.0  Product1  522.0   East    8.000000
4   2023-01-05        B   26.0  Product3  869.0  North   26.000000
5   2023-01-06        B   54.0  Product3  192.0   West   54.000000
6   2023-01-07        A   16.0  Product1  936.0   East   16.000000
7   2023-01-08        C   89.0  Product1  488.0   West   89.000000
8   2023-01-09        C   37.0  Product3  772.0   West   37.000000
9   2023-01-10        A   22.0  Product2  834.0   West   22.000000
10  2023-01-11        B    7.0  Product1  842.0  North    7.000000
11  2023-01-12        B   60.0  Product2    NaN   West   60.000000
12  2023-01-13        A   70.0  Product3  628.0  South   70.000000
13  2023-01-14        A   69.0  Product1  423.0   East   69.000000
14  2023-01-15        A   47.0  Product2  893.0   West   47.000000
15  2023-01-16        C    NaN  Product1  895.0  North   51.744681
16  2023-01-17        C   93.0  Product2  511.0  South   93.000000
17  2023-01-18        C    NaN  Product1  108.0   West   51.744681
18  2023-01-19        A   31.0  Product2  578.0   West   31.000000
19  2023-01-20        A   59.0  Product1  736.0   East   59.000000
20  2023-01-21        C   82.0  Product3  606.0  South   82.000000
21  2023-01-22        C   37.0  Product2  992.0  South   37.000000
22  2023-01-23        B   62.0  Product3  942.0  North   62.000000
23  2023-01-24        C   92.0  Product2  342.0   West   92.000000
24  2023-01-25        A   24.0  Product2  458.0   East   24.000000
25  2023-01-26        C   95.0  Product1  584.0   West   95.000000
26  2023-01-27        C   71.0  Product2  619.0  North   71.000000
27  2023-01-28        C   56.0  Product2  224.0  North   56.000000
28  2023-01-29        B    NaN  Product3  617.0  North   51.744681
29  2023-01-30        C   51.0  Product2  737.0  South   51.000000
30  2023-01-31        B   50.0  Product3  735.0   West   50.000000
31  2023-02-01        A   17.0  Product2  189.0   West   17.000000
32  2023-02-02        B   63.0  Product3  338.0  South   63.000000
33  2023-02-03        C   27.0  Product3    NaN   East   27.000000
34  2023-02-04        C   70.0  Product3  669.0   West   70.000000
35  2023-02-05        B   60.0  Product2    NaN   West   60.000000
36  2023-02-06        C   36.0  Product3  177.0   East   36.000000
37  2023-02-07        C    2.0  Product1    NaN  North    2.000000
38  2023-02-08        C   94.0  Product1  408.0  South   94.000000
39  2023-02-09        A   62.0  Product1  155.0   West   62.000000
40  2023-02-10        B   15.0  Product1  578.0   East   15.000000
41  2023-02-11        C   97.0  Product1  256.0   East   97.000000
42  2023-02-12        A   93.0  Product3  164.0   West   93.000000
43  2023-02-13        A   43.0  Product3  949.0   East   43.000000
44  2023-02-14        A   96.0  Product3  830.0   East   96.000000
45  2023-02-15        B   99.0  Product2  599.0   West   99.000000
46  2023-02-16        B    6.0  Product1  938.0  South    6.000000
47  2023-02-17        B   69.0  Product3  143.0   West   69.000000
48  2023-02-18        C   65.0  Product3  182.0  North   65.000000
49  2023-02-19        C   11.0  Product3  708.0  North   11.000000

In [10]:
df.dtypes

Date           object
Category       object
Value         float64
Product        object
Sales         float64
Region         object
filled_val    float64
dtype: object

In [13]:
## Renaming columns
df = df.rename(columns={'Date':'Sale_Date'})
df.head(6)

    Sale_Date Category  Value   Product  Sales Region  filled_val
0  2023-01-01        A   28.0  Product1  754.0   East        28.0
1  2023-01-02        B   39.0  Product3  110.0  North        39.0
2  2023-01-03        C   32.0  Product2  398.0   East        32.0
3  2023-01-04        B    8.0  Product1  522.0   East         8.0
4  2023-01-05        B   26.0  Product3  869.0  North        26.0
5  2023-01-06        B   54.0  Product3  192.0   West        54.0

In [14]:
df['filled_val'] = df['filled_val'].astype(int)
df.head()

    Sale_Date Category  Value   Product  Sales Region  filled_val
0  2023-01-01        A   28.0  Product1  754.0   East          28
1  2023-01-02        B   39.0  Product3  110.0  North          39
2  2023-01-03        C   32.0  Product2  398.0   East          32
3  2023-01-04        B    8.0  Product1  522.0   East           8
4  2023-01-05        B   26.0  Product3  869.0  North          26

In [16]:
df['New_Value'] = df['filled_val'].apply(lambda x : x * 2)
df.head()

    Sale_Date Category  Value   Product  Sales Region  filled_val  New_Value
0  2023-01-01        A   28.0  Product1  754.0   East          28         56
1  2023-01-02        B   39.0  Product3  110.0  North          39         78
2  2023-01-03        C   32.0  Product2  398.0   East          32         64
3  2023-01-04        B    8.0  Product1  522.0   East           8         16
4  2023-01-05        B   26.0  Product3  869.0  North          26         52

In [17]:
## Data aggregating and grouping
df.head()

    Sale_Date Category  Value   Product  Sales Region  filled_val  New_Value
0  2023-01-01        A   28.0  Product1  754.0   East          28         56
1  2023-01-02        B   39.0  Product3  110.0  North          39         78
2  2023-01-03        C   32.0  Product2  398.0   East          32         64
3  2023-01-04        B    8.0  Product1  522.0   East           8         16
4  2023-01-05        B   26.0  Product3  869.0  North          26         52

In [18]:
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [20]:
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [21]:
grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])
grouped_agg

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

In [27]:
## Merging and joining DataFrames
df1 = pd.DataFrame({'key': ['a','b','c'], 
                    'Value':[1,2,3]})
df2 = pd.DataFrame({'key': ['c','d','e'], 'value': [4,5,6]})

In [28]:
df1

  key  Value
0   a      1
1   b      2
2   c      3

In [29]:
df2

  key  value
0   c      4
1   d      5
2   e      6

In [30]:
## Merge DataFrame on the Key columns
pd.merge(df1,df2,on='key',how='inner')

  key  Value  value
0   c      3      4

In [31]:
pd.merge(df1,df2,on='key',how = 'outer')

  key  Value  value
0   a    1.0    NaN
1   b    2.0    NaN
2   c    3.0    4.0
3   d    NaN    5.0
4   e    NaN    6.0

In [32]:
pd.merge(df1,df2,on='key',how = 'left')

  key  Value  value
0   a      1    NaN
1   b      2    NaN
2   c      3    4.0

In [33]:
pd.merge(df1,df2,on='key',how = 'right')

  key  Value  value
0   c    3.0      4
1   d    NaN      5
2   e    NaN      6